packages/xml-parser/tests/Resources/invoice/invoice-full.xml

<?xml version="1.0" encoding="UTF-8"?>
<Invoice xmlns="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2" xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:ext="urn:oasis:names:specification:ubl:schema:xsd:CommonExtensionComponents-2" xmlns:sac="urn:sunat:names:specification:ubl:peru:schema:xsd:SunatAggregateComponents-1">
   <ext:UBLExtensions>
      <ext:UBLExtension>
         <ext:ExtensionContent>
            <sac:AdditionalInformation>
               <sac:AdditionalMonetaryTotal>
                  <cbc:ID>2005</cbc:ID>
                  <cbc:PayableAmount currencyID="PEN">23.00</cbc:PayableAmount>
               </sac:AdditionalMonetaryTotal>
               <sac:AdditionalMonetaryTotal>
                  <cbc:ID>1001</cbc:ID>
                  <cbc:PayableAmount currencyID="PEN">200.00</cbc:PayableAmount>
               </sac:AdditionalMonetaryTotal>
               <sac:AdditionalMonetaryTotal>
                  <cbc:ID>1002</cbc:ID>
                  <cbc:PayableAmount currencyID="PEN">0.00</cbc:PayableAmount>
               </sac:AdditionalMonetaryTotal>
               <sac:AdditionalMonetaryTotal>
                  <cbc:ID>1003</cbc:ID>
                  <cbc:PayableAmount currencyID="PEN">0.00</cbc:PayableAmount>
               </sac:AdditionalMonetaryTotal>
               <sac:AdditionalMonetaryTotal>
                  <cbc:ID>1004</cbc:ID>
                  <cbc:PayableAmount currencyID="PEN">12.00</cbc:PayableAmount>
               </sac:AdditionalMonetaryTotal>
               <sac:AdditionalProperty>
                  <cbc:ID>1002</cbc:ID>
                  <cbc:Value>TRANSFERENCIA GRATUITA</cbc:Value>
               </sac:AdditionalProperty>
               <sac:AdditionalMonetaryTotal>
                  <cbc:ID>2003</cbc:ID>
                  <cbc:ReferenceAmount currencyID="PEN">2000.00</cbc:ReferenceAmount>
                  <cbc:PayableAmount currencyID="PEN">2228.30</cbc:PayableAmount>
                  <cbc:Percent>9.00</cbc:Percent>
               </sac:AdditionalMonetaryTotal>
               <sac:AdditionalMonetaryTotal>
                  <cbc:ID schemeID="01">2001</cbc:ID>
                  <sac:ReferenceAmount currencyID="PEN">3.00</sac:ReferenceAmount>
                  <cbc:PayableAmount currencyID="PEN">2.00</cbc:PayableAmount>
                  <sac:TotalAmount currencyID="PEN">4.00</sac:TotalAmount>
               </sac:AdditionalMonetaryTotal>
               <sac:AdditionalProperty>
                  <cbc:ID>2000</cbc:ID>
                  <cbc:Value>COMPROBANTE DE PERCEPCION</cbc:Value>
               </sac:AdditionalProperty>
               <sac:AdditionalProperty>
                  <cbc:ID>1000</cbc:ID>
                  <cbc:Value>SON N SOLES</cbc:Value>
               </sac:AdditionalProperty>
               <sac:SUNATEmbededDespatchAdvice>
                  <cac:DeliveryAddress>
                     <cbc:ID>070101</cbc:ID>
                     <cbc:StreetName>AV. REPUBLICA DE ARGENTINA N? 2976 URB.</cbc:StreetName>
                  </cac:DeliveryAddress>
                  <cac:OriginAddress>
                     <cbc:ID>070101</cbc:ID>
                     <cbc:StreetName>AV OSCAR R BENAVIDES No 5915  PE</cbc:StreetName>
                  </cac:OriginAddress>
                  <sac:SUNATCarrierParty>
                     <cbc:CustomerAssignedAccountID>20100006376</cbc:CustomerAssignedAccountID>
                     <cbc:AdditionalAccountID>6</cbc:AdditionalAccountID>
                     <cac:Party>
                        <cac:PartyLegalEntity>
                           <cbc:RegistrationName>TRANS SAC</cbc:RegistrationName>
                        </cac:PartyLegalEntity>
                     </cac:Party>
                  </sac:SUNATCarrierParty>
                  <sac:DriverParty>
                     <cac:Party>
                        <cac:PartyIdentification>
                           <cbc:ID>1111111111</cbc:ID>
                        </cac:PartyIdentification>
                     </cac:Party>
                  </sac:DriverParty>
                  <sac:SUNATRoadTransport>
                     <cbc:LicensePlateID>B9Y-778</cbc:LicensePlateID>
                     <cbc:TransportAuthorizationCode>112121</cbc:TransportAuthorizationCode>
                     <cbc:BrandName>Scania</cbc:BrandName>
                  </sac:SUNATRoadTransport>
                  <cbc:TransportModeCode>01</cbc:TransportModeCode>
                  <cbc:GrossWeightMeasure unitCode="KGM">2020.23</cbc:GrossWeightMeasure>
               </sac:SUNATEmbededDespatchAdvice>
               <sac:SUNATTransaction>
                  <cbc:ID>2</cbc:ID>
               </sac:SUNATTransaction>
            </sac:AdditionalInformation>
         </ext:ExtensionContent>
      </ext:UBLExtension>
      <ext:UBLExtension>
         <ext:ExtensionContent />
      </ext:UBLExtension>
   </ext:UBLExtensions>
   <cbc:UBLVersionID>2.0</cbc:UBLVersionID>
   <cbc:CustomizationID>1.0</cbc:CustomizationID>
   <cbc:ID>F001-123</cbc:ID>
   <cbc:IssueDate>2017-09-29</cbc:IssueDate>
   <cbc:InvoiceTypeCode>01</cbc:InvoiceTypeCode>
   <cbc:DocumentCurrencyCode>PEN</cbc:DocumentCurrencyCode>
   <cac:OrderReference>
      <cbc:ID>001-12112</cbc:ID>
   </cac:OrderReference>
   <cac:DespatchDocumentReference>
      <cbc:ID>T001-1</cbc:ID>
      <cbc:DocumentTypeCode>09</cbc:DocumentTypeCode>
   </cac:DespatchDocumentReference>
   <cac:AdditionalDocumentReference>
      <cbc:ID>F001-123</cbc:ID>
      <cbc:DocumentTypeCode>01</cbc:DocumentTypeCode>
   </cac:AdditionalDocumentReference>
   <cac:Signature>
      <cbc:ID>20000000001</cbc:ID>
      <cbc:Note>GREENTER Builder</cbc:Note>
      <cac:SignatoryParty>
         <cac:PartyIdentification>
            <cbc:ID>20000000001</cbc:ID>
         </cac:PartyIdentification>
         <cac:PartyName>
            <cbc:Name>EMPRESA</cbc:Name>
         </cac:PartyName>
      </cac:SignatoryParty>
      <cac:DigitalSignatureAttachment>
         <cac:ExternalReference>
            <cbc:URI>#SIGN-GREEN</cbc:URI>
         </cac:ExternalReference>
      </cac:DigitalSignatureAttachment>
   </cac:Signature>
   <cac:AccountingSupplierParty>
      <cbc:CustomerAssignedAccountID>20000000001</cbc:CustomerAssignedAccountID>
      <cbc:AdditionalAccountID>6</cbc:AdditionalAccountID>
      <cac:Party>
         <cac:PartyName>
            <cbc:Name>EMPRESA</cbc:Name>
         </cac:PartyName>
         <cac:PostalAddress>
            <cbc:ID>150101</cbc:ID>
            <cbc:StreetName>AV LS</cbc:StreetName>
            <cac:Country>
               <cbc:IdentificationCode>PE</cbc:IdentificationCode>
            </cac:Country>
         </cac:PostalAddress>
         <cac:PartyLegalEntity>
            <cbc:RegistrationName>EMPRESA SAC</cbc:RegistrationName>
         </cac:PartyLegalEntity>
      </cac:Party>
   </cac:AccountingSupplierParty>
   <cac:AccountingCustomerParty>
      <cbc:CustomerAssignedAccountID>20000000001</cbc:CustomerAssignedAccountID>
      <cbc:AdditionalAccountID>6</cbc:AdditionalAccountID>
      <cac:Party>
         <cac:PartyLegalEntity>
            <cbc:RegistrationName>EMPRESA 1</cbc:RegistrationName>
         </cac:PartyLegalEntity>
      </cac:Party>
   </cac:AccountingCustomerParty>
   <cac:PaymentMeans>
      <cbc:PaymentMeansCode>1</cbc:PaymentMeansCode>
      <cbc:PaymentDueDate>2017-09-30</cbc:PaymentDueDate>
   </cac:PaymentMeans>
   <cac:PrepaidPayment>
      <cbc:ID schemeID="02">F001-21</cbc:ID>
      <cbc:PaidAmount currencyID="PEN">100.00</cbc:PaidAmount>
      <cbc:InstructionID schemeID="6">20000000001</cbc:InstructionID>
   </cac:PrepaidPayment>
   <cac:PrepaidPayment>
      <cbc:ID schemeID="02">F001-23</cbc:ID>
      <cbc:PaidAmount currencyID="PEN">200.00</cbc:PaidAmount>
      <cbc:InstructionID schemeID="6">20000000001</cbc:InstructionID>
   </cac:PrepaidPayment>
   <cac:TaxTotal>
      <cbc:TaxAmount currencyID="PEN">2.00</cbc:TaxAmount>
      <cac:TaxSubtotal>
         <cbc:TaxAmount currencyID="PEN">2.00</cbc:TaxAmount>
         <cac:TaxCategory>
            <cac:TaxScheme>
               <cbc:ID>2000</cbc:ID>
               <cbc:Name>ISC</cbc:Name>
               <cbc:TaxTypeCode>EXC</cbc:TaxTypeCode>
            </cac:TaxScheme>
         </cac:TaxCategory>
      </cac:TaxSubtotal>
   </cac:TaxTotal>
   <cac:TaxTotal>
      <cbc:TaxAmount currencyID="PEN">36.00</cbc:TaxAmount>
      <cac:TaxSubtotal>
         <cbc:TaxAmount currencyID="PEN">36.00</cbc:TaxAmount>
         <cac:TaxCategory>
            <cac:TaxScheme>
               <cbc:ID>1000</cbc:ID>
               <cbc:Name>IGV</cbc:Name>
               <cbc:TaxTypeCode>VAT</cbc:TaxTypeCode>
            </cac:TaxScheme>
         </cac:TaxCategory>
      </cac:TaxSubtotal>
   </cac:TaxTotal>
   <cac:TaxTotal>
      <cbc:TaxAmount currencyID="PEN">12.00</cbc:TaxAmount>
      <cac:TaxSubtotal>
         <cbc:TaxAmount currencyID="PEN">12.00</cbc:TaxAmount>
         <cac:TaxCategory>
            <cac:TaxScheme>
               <cbc:ID>9999</cbc:ID>
               <cbc:Name>OTROS</cbc:Name>
               <cbc:TaxTypeCode>&gt;OTH</cbc:TaxTypeCode>
            </cac:TaxScheme>
         </cac:TaxCategory>
      </cac:TaxSubtotal>
   </cac:TaxTotal>
   <cac:LegalMonetaryTotal>
      <cbc:PrepaidAmount currencyID="PEN">300.00</cbc:PrepaidAmount>
      <cbc:AllowanceTotalAmount currencyID="PEN">12.00</cbc:AllowanceTotalAmount>
      <cbc:ChargeTotalAmount currencyID="PEN">1.00</cbc:ChargeTotalAmount>
      <cbc:PayableAmount currencyID="PEN">236.00</cbc:PayableAmount>
   </cac:LegalMonetaryTotal>
   <cac:InvoiceLine>
      <cbc:ID>1</cbc:ID>
      <cbc:InvoicedQuantity unitCode="NIU">2</cbc:InvoicedQuantity>
      <cbc:LineExtensionAmount currencyID="PEN">100.00</cbc:LineExtensionAmount>
      <cac:PricingReference>
         <cac:AlternativeConditionPrice>
            <cbc:PriceAmount currencyID="PEN">56.00</cbc:PriceAmount>
            <cbc:PriceTypeCode>01</cbc:PriceTypeCode>
         </cac:AlternativeConditionPrice>
      </cac:PricingReference>
      <cac:AllowanceCharge>
         <cbc:ChargeIndicator>false</cbc:ChargeIndicator>
         <cbc:Amount currencyID="PEN">0</cbc:Amount>
      </cac:AllowanceCharge>
      <cac:TaxTotal>
         <cbc:TaxAmount currencyID="PEN">3.00</cbc:TaxAmount>
         <cac:TaxSubtotal>
            <cbc:TaxAmount currencyID="PEN">3.00</cbc:TaxAmount>
            <cac:TaxCategory>
               <cbc:TierRange>3</cbc:TierRange>
               <cac:TaxScheme>
                  <cbc:ID>2000</cbc:ID>
                  <cbc:Name>ISC</cbc:Name>
                  <cbc:TaxTypeCode>EXC</cbc:TaxTypeCode>
               </cac:TaxScheme>
            </cac:TaxCategory>
         </cac:TaxSubtotal>
      </cac:TaxTotal>
      <cac:TaxTotal>
         <cbc:TaxAmount currencyID="PEN">18.00</cbc:TaxAmount>
         <cac:TaxSubtotal>
            <cbc:TaxAmount currencyID="PEN">18.00</cbc:TaxAmount>
            <cac:TaxCategory>
               <cbc:TaxExemptionReasonCode>10</cbc:TaxExemptionReasonCode>
               <cac:TaxScheme>
                  <cbc:ID>1000</cbc:ID>
                  <cbc:Name>IGV</cbc:Name>
                  <cbc:TaxTypeCode>VAT</cbc:TaxTypeCode>
               </cac:TaxScheme>
            </cac:TaxCategory>
         </cac:TaxSubtotal>
      </cac:TaxTotal>
      <cac:Item>
         <cbc:Description>PROD 1</cbc:Description>
         <cac:SellersItemIdentification>
            <cbc:ID>C023</cbc:ID>
         </cac:SellersItemIdentification>
      </cac:Item>
      <cac:Price>
         <cbc:PriceAmount currencyID="PEN">50.00</cbc:PriceAmount>
      </cac:Price>
   </cac:InvoiceLine>
   <cac:InvoiceLine>
      <cbc:ID>2</cbc:ID>
      <cbc:InvoicedQuantity unitCode="NIU">2</cbc:InvoicedQuantity>
      <cbc:LineExtensionAmount currencyID="PEN">100.00</cbc:LineExtensionAmount>
      <cac:PricingReference>
         <cac:AlternativeConditionPrice>
            <cbc:PriceAmount currencyID="PEN">2.00</cbc:PriceAmount>
            <cbc:PriceTypeCode>02</cbc:PriceTypeCode>
         </cac:AlternativeConditionPrice>
      </cac:PricingReference>
      <cac:AllowanceCharge>
         <cbc:ChargeIndicator>false</cbc:ChargeIndicator>
         <cbc:Amount currencyID="PEN">0</cbc:Amount>
      </cac:AllowanceCharge>
      <cac:TaxTotal>
         <cbc:TaxAmount currencyID="PEN">18.00</cbc:TaxAmount>
         <cac:TaxSubtotal>
            <cbc:TaxAmount currencyID="PEN">18.00</cbc:TaxAmount>
            <cac:TaxCategory>
               <cbc:TaxExemptionReasonCode>10</cbc:TaxExemptionReasonCode>
               <cac:TaxScheme>
                  <cbc:ID>1000</cbc:ID>
                  <cbc:Name>IGV</cbc:Name>
                  <cbc:TaxTypeCode>VAT</cbc:TaxTypeCode>
               </cac:TaxScheme>
            </cac:TaxCategory>
         </cac:TaxSubtotal>
      </cac:TaxTotal>
      <cac:Item>
         <cbc:Description>PROD 2</cbc:Description>
         <cac:SellersItemIdentification>
            <cbc:ID>C02</cbc:ID>
         </cac:SellersItemIdentification>
      </cac:Item>
      <cac:Price>
         <cbc:PriceAmount currencyID="PEN">10.00</cbc:PriceAmount>
      </cac:Price>
   </cac:InvoiceLine>
</Invoice>